[
  {
    "year": "1972",
    "title": "Magnavox Odyssey",
    "description": "The first home console in video game history. Used printed circuit cards to simulate games.",
    "image": "magnavox-odyssey.jpg"
  },
  {
    "year": "1975",
    "title": "Odyssey 100",
    "description": "Successor to the Magnavox with built-in games and simple black-and-white graphics. Popularized consoles in American households.",
    "image": "odyssey-100.jpg"
  },
  {
    "year": "1975",
    "title": "Pong",
    "description": "Inspired by table tennis, Pong was a huge arcade success and spawned several home versions.",
    "image": "pong.jpg"
  },
  {
    "year": "1976",
    "title": "Channel F",
    "description": "Created by Fairchild, it was the first console with interchangeable ROM cartridges and its own microprocessor.",
    "image": "channel-f.jpg"
  },
  {
    "year": "1976",
    "title": "TV Fun (Model 401)",
    "description": "Coleco console focused on Pong-style games, with different built-in sports variations.",
    "image": "tv-fun-modelo-401.jpg"
  },
  {
    "year": "1977",
    "title": "Atari VCS",
    "description": "Released as the Atari Video Computer System, it was the first widely popular console with interchangeable cartridges, becoming a classic era milestone.",
    "image": "atari-vcs.jpg"
  },
  {
    "year": "1977",
    "title": "Color TV Game 6",
    "description": "Nintendo's first console, featuring six Pong variants. It marked the company's entry into the home video game market.",
    "image": "color-tv-game-6.jpg"
  },
  {
    "year": "1977",
    "title": "RCA Studio II",
    "description": "One of the first consoles to use interchangeable cartridges. Despite its black-and-white graphics and built-in controls, it helped shape the second generation.",
    "image": "rca-studio-2.jpg"
  },
  {
    "year": "1978",
    "title": "APF-MP 1000",
    "description": "8-bit console from APF with cartridges and color graphics. Attempted to compete with the Atari 2600 but had limited impact.",
    "image": "apf-mp1000.jpg"
  },
  {
    "year": "1978",
    "title": "Bally Astrocade",
    "description": "Known for its advanced graphics and built-in keyboard, the Astrocade offered cartridge games and BASIC programming.",
    "image": "bally-astrocade.jpg"
  },
  {
    "year": "1978",
    "title": "Interton VC 4000",
    "description": "German second-gen console with interchangeable cartridges and color graphics. Inspired many clones across Europe.",
    "image": "interton-vc4000.jpg"
  },
  {
    "year": "1978",
    "title": "Odyssey 2",
    "description": "Successor to the Magnavox Odyssey, combining cartridges, a built-in keyboard, and educational titles. Competed directly with the Atari 2600.",
    "image": "odyssey-2.jpg"
  },
  {
    "year": "1978",
    "title": "Telstar Colortron",
    "description": "Part of Coleco's Telstar series, it offered Pong variations with color graphics and analog dials. One of the last before cartridges took over.",
    "image": "telstar-colortron.jpg"
  },
  {
    "year": "1979",
    "title": "Intellivision",
    "description": "Released by Mattel, Intellivision featured better graphics than the Atari 2600 and number-pad controllers. Pioneered sports and strategy games.",
    "image": "intellivision.jpg"
  },
  {
    "year": "1981",
    "title": "Cassette Vision",
    "description": "Developed by Epoch, it was Japan's first console with interchangeable cartridges. Popular until the Famicom launched.",
    "image": "cassette-vision.jpg"
  },
  {
    "year": "1981",
    "title": "CreatiVision",
    "description": "Developed by VTech, it combined console and computer features, with a built-in keyboard and cartridge games. Released under various names worldwide.",
    "image": "creativision.jpg"
  },
  {
    "year": "1982",
    "title": "Atari 5200",
    "description": "Successor to the 2600, offering better graphics and analog control. Criticized for lack of backward compatibility and unreliable controllers.",
    "image": "atari-5200.jpg"
  },
  {
    "year": "1982",
    "title": "ColecoVision",
    "description": "Known for advanced graphics and sound, it brought arcade-like experiences home and launched hits like Donkey Kong.",
    "image": "colecovision.jpg"
  },
  {
    "year": "1982",
    "title": "Vectrex",
    "description": "Unique console with built-in black-and-white screen and vector graphics. Delivered arcade-style gameplay without a TV.",
    "image": "vectrex.jpg"
  },
  {
    "year": "1983",
    "title": "Casio PV-1000",
    "description": "Japan-only 8-bit console by Casio. Despite early promise, it saw few releases and was quickly discontinued.",
    "image": "casio-pv1000.jpg"
  },
  {
    "year": "1983",
    "title": "Famicom",
    "description": "Released in Japan, the Family Computer revolutionized home consoles with high-quality cartridges and iconic franchises. It came to the West in 1985 as the NES.",
    "image": "famicom.jpg"
  },
  {
    "year": "1983",
    "title": "SG-1000",
    "description": "Sega’s first console, released the same day as the Famicom. Though modest, it marked the company’s entry into home consoles.",
    "image": "sg-1000.jpg"
  },
  {
    "year": "1983",
    "title": "Super Cassette Vision",
    "description": "Successor to the Cassette Vision, Epoch’s console featured improved graphics and licensed anime games like Doraemon and Dragon Ball.",
    "image": "super-cassette-vision.jpg"
  },
  {
    "year": "1985",
    "title": "Nintendo Entertainment System",
    "description": "Revived the video game industry after the 1983 crash. The NES popularized classics like Super Mario Bros. and The Legend of Zelda, defining the 8-bit era.",
    "image": "nes.jpg"
  },
  {
    "year": "1985",
    "title": "Sega Mark III",
    "description": "Japanese version of what would become the Master System. Sega’s 8-bit offering competed with the Famicom with superior graphics and arcade-style games.",
    "image": "sega-mark-3.jpg"
  },
  {
    "year": "1986",
    "title": "Atari 7800",
    "description": "Successor to the 2600 with improved graphics and backward compatibility. Launched amid Nintendo’s resurgence, it struggled for relevance.",
    "image": "atari-7800.jpg"
  },
  {
    "year": "1986",
    "title": "Master System",
    "description": "Originally released in Japan as the Mark III, Sega’s 8-bit console thrived in markets like Brazil. Famous for Alex Kidd, Sonic, and Wonder Boy.",
    "image": "master-system.jpg"
  },
  {
    "year": "1987",
    "title": "PC Engine",
    "description": "Developed by NEC and Hudson Soft, this compact console debuted in Japan with HuCard games. Known as the TurboGrafx-16 in the US and pioneered CD-ROM gaming.",
    "image": "pc-engine.jpg"
  },
  {
    "year": "1988",
    "title": "Mega Drive",
    "description": "Sega’s entry into the 16-bit era, delivering advanced graphics and audio. Home to hits like Sonic the Hedgehog and hugely successful in the West.",
    "image": "mega-drive.jpg"
  },
  {
    "year": "1989",
    "title": "Genesis",
    "description": "US version of the Mega Drive. Marketed as the cool alternative to Nintendo, it featured fast action games like Sonic, Streets of Rage, and Altered Beast.",
    "image": "genesis.jpg"
  },
  {
    "year": "1989",
    "title": "Interactive Vision",
    "description": "An interactive console by View-Master Ideal aimed at children. Used VHS tapes to blend cartoons with playable segments featuring characters like the Muppets.",
    "image": "interactive-vision.jpg"
  },
  {
    "year": "1989",
    "title": "TurboGrafx-16",
    "description": "Known in Japan as the PC Engine, it featured 16-bit graphics chips and card-based games. Expanded later with CD-ROM accessories.",
    "image": "turbografx-16.jpg"
  },
  {
    "year": "1990",
    "title": "Commodore C64 GS",
    "description": "Game-focused version of the Commodore 64 computer. Used cartridges but lacked a keyboard, which limited its appeal and game library.",
    "image": "commodore-c64-gs.jpg"
  },
  {
    "year": "1990",
    "title": "GX4000",
    "description": "Amstrad’s attempt at a home console with cartridge support and futuristic design. Based on CPC computer hardware, but had few games and failed quickly.",
    "image": "gx4000.jpg"
  },
  {
    "year": "1990",
    "title": "Super Famicom",
    "description": "Successor to the Famicom in Japan. Brought rich 16-bit visuals, stereo sound, and classics like Super Mario World and Zelda: A Link to the Past.",
    "image": "super-famicom.jpg"
  },
  {
    "year": "1991",
    "title": "CD-i",
    "description": "Philips’ multimedia system combining games, educational software, and movies on CD. Known for its odd Nintendo-licensed titles with animated cutscenes.",
    "image": "cd-i.jpg"
  },
  {
    "year": "1991",
    "title": "Neo Geo AES",
    "description": "SNK’s high-end console that brought arcade-quality games home. Famous for premium pricing and legendary franchises like King of Fighters and Metal Slug.",
    "image": "neo-geo-aes.jpg"
  },
  {
    "year": "1991",
    "title": "Super Nintendo",
    "description": "The 16-bit Super NES delivered groundbreaking visuals, audio, and gameplay. Featured iconic games like Mario, Zelda, and Star Fox with the Super FX chip.",
    "image": "super-nintendo.jpg"
  },
  {
    "year": "1993",
    "title": "3DO (Model FZ-1)",
    "description": "A 32-bit console built by Panasonic and backed by EA. Ahead of its time, but hindered by high price and lack of widespread support.",
    "image": "3do-fz1.jpg"
  },
  {
    "year": "1993",
    "title": "FM Towns Marty",
    "description": "Japan’s first CD-ROM-based console derived from PC hardware. Played FM Towns games, but was expensive and lacked widespread support.",
    "image": "fm-towns-marty.jpg"
  },
  {
    "year": "1993",
    "title": "Jaguar",
    "description": "Marketed as the first 64-bit console, Atari’s Jaguar had complex architecture and few games, resulting in commercial failure. It marked Atari’s final console.",
    "image": "jaguar.jpg"
  },
  {
    "year": "1993",
    "title": "Laseractive",
    "description": "High-end LaserDisc-based console by Pioneer. With modules, it could play Mega Drive and PC Engine games. Expensive and niche, with few titles.",
    "image": "laseractive.jpg"
  },
  {
    "year": "1994",
    "title": "Neo Geo CD",
    "description": "A cheaper alternative to the AES, it used CDs instead of cartridges. Popular in Japan, but suffered from long loading times.",
    "image": "neo-geo-cd.jpg"
  },
  {
    "year": "1994",
    "title": "PC-FX",
    "description": "Successor to the PC Engine by NEC. Focused on anime-style FMV games. Poor sales due to a limited library and genre scope.",
    "image": "pc-fx.jpg"
  },
  {
    "year": "1994",
    "title": "Playdia",
    "description": "Bandai’s multimedia console for children. Featured interactive anime content from series like Dragon Ball and Sailor Moon. Commercially unsuccessful.",
    "image": "playdia.jpg"
  },
  {
    "year": "1994",
    "title": "PlayStation",
    "description": "Sony’s debut console redefined gaming with 3D graphics and CDs. Spawned classics like Final Fantasy VII, Resident Evil, and Gran Turismo.",
    "image": "playstation.jpg"
  },
  {
    "year": "1994",
    "title": "Sega Saturn (JP)",
    "description": "Launched in Japan with strong 2D performance and later 3D. Hit games like Virtua Fighter shined, but hardware complexity proved challenging.",
    "image": "sega-saturn-jp.jpg"
  },
  {
    "year": "1995",
    "title": "Loopy",
    "description": "Released by Casio in Japan, Loopy was a console targeted at girls. Its standout feature was a built-in printer that let players make stickers from game screenshots.",
    "image": "loopy.jpg"
  },
  {
    "year": "1995",
    "title": "Sega Saturn (US, EU)",
    "description": "Released in North America and Europe, the Saturn had strong 2D/3D performance and notable titles, but struggled due to poor marketing and PlayStation competition.",
    "image": "sega-saturn-us-eu.jpg"
  },
  {
    "year": "1995",
    "title": "Super A'Can",
    "description": "A 16-bit console released only in Taiwan. Developed by Funtech, it had very limited sales and is now one of the rarest and most curious consoles ever.",
    "image": "super-a-can.jpg"
  },
  {
    "year": "1996",
    "title": "Nintendo 64",
    "description": "Nintendo’s first fully 3D console. With iconic games like Super Mario 64 and Ocarina of Time, it set a standard for immersive 3D gameplay.",
    "image": "nintendo-64.jpg"
  },
  {
    "year": "1996",
    "title": "Pippin",
    "description": "The Apple Bandai Pippin aimed to merge computing and gaming. Despite its innovation, it failed commercially and became a tech oddity.",
    "image": "pippin.jpg"
  },
  {
    "year": "1998",
    "title": "Dreamcast",
    "description": "Sega’s final console, released in Japan in 1998. Praised for its innovation and online features, but overshadowed by Sony's upcoming PS2.",
    "image": "dreamcast.jpg"
  },
  {
    "year": "2000",
    "title": "PlayStation 2",
    "description": "The best-selling console in history. Launched with DVD support, a vast game library, and backward compatibility, it defined an entire generation of gamers.",
    "image": "playStation-2.jpg"
  },
  {
    "year": "2001",
    "title": "GameCube",
    "description": "Nintendo’s compact, disc-based console with a handle for portability. Brought hits like Super Smash Bros. Melee and Metroid Prime.",
    "image": "gamecube.jpg"
  },
  {
    "year": "2001",
    "title": "Xbox",
    "description": "Microsoft’s first entry into the console market. Came with a built-in hard drive and Xbox Live support. Halo made it a major competitor.",
    "image": "xbox.jpg"
  },
  {
    "year": "2004",
    "title": "Xavix",
    "description": "The XaviXPORT was a fitness-focused console using motion-sensing controllers like tennis rackets and baseball bats. Created by ex-Nintendo developers.",
    "image": "xavix.jpg"
  },
  {
    "year": "2005",
    "title": "Xbox 360",
    "description": "Microsoft’s second console brought HD graphics, Xbox Live Arcade, and popular franchises like Gears of War and Halo 3.",
    "image": "xbox-360.jpg"
  },
  {
    "year": "2006",
    "title": "Hyperscan",
    "description": "Mattel’s short-lived console used RFID cards to unlock content. Innovative for the time but suffered from few games and poor performance.",
    "image": "hyperscan.jpg"
  },
  {
    "year": "2006",
    "title": "Nintendo Wii",
    "description": "Revolutionized gaming with motion controls and broad appeal. One of Nintendo’s most successful consoles, it became a global phenomenon.",
    "image": "nintendo-wii.jpg"
  },
  {
    "year": "2006",
    "title": "PlayStation 3",
    "description": "Sony’s third console featured a Blu-ray drive and strong first-party exclusives. Despite a rocky launch, it gained momentum over time.",
    "image": "playstation-3.jpg"
  },
  {
    "year": "2009",
    "title": "Zeebo",
    "description": "Launched in Brazil, the Zeebo was a digital-only console developed by Tectoy and Qualcomm. It aimed to combat piracy and offer affordable gaming via 3G downloads.",
    "image": "zeebo.jpg"
  },
  {
    "year": "2012",
    "title": "Nintendo Wii U",
    "description": "Successor to the Wii and Nintendo’s first HD console. Featured a touchscreen GamePad for off-TV play. Innovative, but suffered from poor marketing and limited third-party support.",
    "image": "nintendo-wii-u.jpg"
  },
  {
    "year": "2013",
    "title": "PlayStation 4",
    "description": "Sony’s fourth console featured powerful hardware, a social focus, and digital-first strategy. Became one of the best-selling consoles of all time.",
    "image": "playstation-4.jpg"
  },
  {
    "year": "2013",
    "title": "Xbox One",
    "description": "Microsoft’s entertainment-focused console included TV and app integration. After a controversial launch, it recovered with strong services like Game Pass.",
    "image": "xbox-one.jpg"
  },
  {
    "year": "2017",
    "title": "Nintendo Switch",
    "description": "Nintendo’s hybrid console combined handheld and home gaming. Joy-Con controllers and games like Zelda: Breath of the Wild made it a global success.",
    "image": "nintendo-switch.jpg"
  },
  {
    "year": "2020",
    "title": "PlayStation 5",
    "description": "Sony’s next-gen console brought 4K graphics, ultra-fast SSD, and the DualSense controller with haptic feedback. Launched with games like Demon's Souls and Spider-Man: Miles Morales.",
    "image": "playstation-5.jpg"
  },
  {
    "year": "2020",
    "title": "Xbox Series S/X",
    "description": "Microsoft launched two consoles: the powerful Xbox Series X with 4K support, and the more affordable digital-only Series S focused on 1440p performance. Both featured SSDs and fast load times.",
    "image": "xbox-series.jpg"
  },
  {
    "year": "2021",
    "title": "Atari VCS (2021 console)",
    "description": "Announced in 2020 and launched in June 2021, this modern take on the Atari VCS mixes retro aesthetics with PC functionality. However, it underperformed against modern competitors.",
    "image": "atari-vcs-2021.jpg"
  },
  {
    "year": "2022",
    "title": "Steam Deck",
    "description": "Handheld PC gaming console by Valve, launched in February 2022. Runs SteamOS and plays most PC games on the go. An OLED model with an improved screen arrived in 2023.",
    "image": "steam-deck.jpg"
  },
  {
    "year": "2025",
    "title": "Nintendo Switch 2",
    "description": "Announced in January and released in June 2025. Maintains the hybrid concept with a 1080p 120Hz screen, 4K support when docked, and GameCube compatibility via expansion.",
    "image": "nintendo-switch-2.jpg"
  }
]




